app/controllers/campaigns_controller.rb

SELECT * FROM "campaigns" WHERE (admin_id = 7)
SELECT campaign_id FROM "dialables" WHERE (user_id =8)
---
  def index
    if current_user

      if current_user.has_role?('admin')
        @campaigns = Campaign.find(:all, :conditions => ['admin_id = ?', current_user.id])
      elsif current_user.has_role?('super')
        @campaigns = Campaign.find(:all)
      elsif current_user.has_role?('agent')
        @campaign_ids = Dialable.find(:all, :select => 'campaign_id', :conditions => ['user_id =?',current_user.id]).map(&:campaign_id)

SELECT * FROM "campaigns" WHERE (title = 'campaign 1') LIMIT 1
SELECT * FROM "donations" WHERE (campaign_id=1)
SELECT sum("donations".donation) AS sum_donation FROM "donations" WHERE ("donations".campaign_id = 1)
SELECT * FROM "accounts" WHERE ("accounts"."id" = 4)
SELECT * FROM "donors" WHERE ("donors"."id" = 4)
---
  def show
    @campaign = Campaign.find(:first, :conditions => ['title = ?', params[:title]])
    @donations = Donation.find(:all, :conditions => ['campaign_id=?', @campaign.id]).paginate :page => params[:page], :per_page  => 10
    if @donations
      @level = Donation.sum('donation', :conditions => ['campaign_id=?', @campaign.id])
      if @level == 0
        @pxstat = 0
      else
        @pxstat = (@level/@campaign.target_amount) * 100
        if @pxstat >= 100
          @pxstat = 100
        end
      end
    else
      @pxstat = 0
      @level = 0
    end
    respond_to do |wants|
      wants.html
      wants.csv do
        @donations = Donation.find(:all, :conditions => ['campaign_id=?', @campaign.id])
        csv_string = FasterCSV.generate do |csv|
          # header row
          csv << ["First Name", "Last Name", "Donation", "Date/Time",
                  "Credit Card", "Name", "Credit Card No.", "Card Expiration",
                  "Business", "Address", "City", "State", "Zip Code", "Phone Number", "Note"]

          # data rows
          @donations.each do |donation|
            csv << [donation.account.donor.first_name,
              donation.account.donor.last_name,
              donation.donation,
              donation.created_at,
              donation.account.card_type,
              donation.account.name,
              "'" + donation.account.creditcard_no + "'",
              donation.account.expiration,
              donation.account.donor.business,
              donation.account.donor.address,
              donation.account.donor.city,
              donation.account.donor.state,
              donation.account.donor.zip_code,
              donation.account.donor.phone,
              donation.note ]

SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 7) LIMIT 1
---
  def list_agents
    @campaign = Campaign.find(params[:campaign_id])
    @agents = User.find(:all, :conditions => ['is_agent = ?', true])

INSERT INTO "dialables" ("updated_at", "campaign_id", "user_id", "created_at") VALUES('2010-07-10 18:45:40', 1, 8, '2010-07-10 18:45:40')
---
  def add_agents

    params[:agent_ids].each do |agents|
      @dialable = Dialable.new
      @dialable.user_id = agents
      @dialable.campaign_id = params[:campaign_id]
      @dialable.save

INSERT INTO "campaigns" ("logo_updated_at", "slogan", "updated_at", "title", "campaign_status_id", "admin_id", "logo_file_name", "description", "target_amount", "deleted", "logo_content_type", "logo_file_size", "created_at") VALUES('2010-07-10 17:46:15', 'test campaign', '2010-07-10 17:46:17', 'campaign 1', 2, 7, 'FEBC.png', 'this is just a test campaign', 5000.0, 'f', 'image/png', 11560, '2010-07-10 17:46:17')
---
  def create
    @campaign = Campaign.new(params[:campaign])
    @campaign.campaign_status_id = params[:campaign_status_id]
    @campaign.deleted = false
    @campaign.admin_id = current_user.id
    if @campaign.save

SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 1)
---
  def edit
    @campaign = Campaign.find(params[:id])

SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 1)
UPDATE "campaigns" SET "campaign_status_id" = 1, "title" = 'campaign1', "updated_at" = '2010-07-10 17:54:43' WHERE "id" = 1
---
  def update
    @campaign = Campaign.find(params[:id])
    @campaign.campaign_status_id = params[:campaign_status_id]
    if @campaign.update_attributes(params[:campaign])