app/controllers/companies_controller.rb

SELECT * FROM "companies" WHERE (user_id = 7)
---
  def index
    if current_user.has_role?('admin')
      @companies = Company.find(:all, :conditions => ['user_id = ?', current_user.id])

SELECT * FROM "companies" WHERE ("companies"."id" = 7)
---
  def show
    @company = Company.find(params[:id])

SELECT * FROM "companies" WHERE ("companies"."id" = 7)
---
  def edit
    @company = Company.find(params[:id])

SELECT * FROM "companies" WHERE ("companies"."id" = 7)
UPDATE "companies" SET "status" = 2, "updated_at" = '2010-07-10 17:38:51' WHERE "id" = 7
---
  def update
    @company = Company.find(params[:id])
    if @company.update_attributes(params[:company])