app/controllers/donors_controller.rb

SELECT * FROM "donors" WHERE ("donors"."id" = 4)
---
  def show
    @donor = Donor.find(params[:id])

SELECT * FROM "campaigns" WHERE (title ='campaign1') LIMIT 1
---
  def new
    @donor = Donor.new
    @account = Account.new
    @donation = Donation.new
    @campaign = Campaign.find(:first, :conditions => ['title =?', params[:title]])

SELECT * FROM "campaigns" WHERE (id = '1') LIMIT 1
INSERT INTO "donations" ("business", "city", "updated_at", "account_id", "campaign_id", "zip_code", "phone", "donation", "note", "user_id", "first_name", "last_name", "address", "state", "email", "created_at") VALUES(NULL, NULL, '2010-07-10 19:05:37', 4, 1, NULL, NULL, NULL, 'this is just a test donation', 8, NULL, NULL, NULL, NULL, NULL, '2010-07-10 19:05:37')
INSERT INTO "donors" ("business", "city", "updated_at", "campaign_id", "zip_code", "phone", "user_id", "first_name", "last_name", "address", "state", "created_at", "email") VALUES('', 'makati', '2010-07-10 18:59:57', 1, '12345', '123-456-7890', 8, 'jane', 'smith', '4321 street', 'mm', '2010-07-10 18:59:57', 'jane.smith@test.com')
INSERT INTO "accounts" ("name", "updated_at", "card_type", "expiration", "creditcard_no", "donor_id", "cvv_code", "created_at") VALUES('jane smith', '2010-07-10 18:59:57', 'MasterCard', '12/15', '4111111111111111', 1, '123', '2010-07-10 18:59:57')
---
  def create
    @donor = Donor.new(params[:donor])
    @donor.campaign_id = params[:donation][:campaign_id]
    @campaign = Campaign.find(:first, :conditions => ['id = ?', params[:donation][:campaign_id]])
    if @donor.save!
      @account = Account.new(params[:account])
      @account.donor_id = @donor.id
      if @account.save!

SELECT * FROM "donors" WHERE ("donors"."id" = 4)
SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 1)
SELECT * FROM "accounts" WHERE ("accounts"."donor_id" = 4) LIMIT 1
SELECT * FROM "donations" WHERE (account_id=4 and campaign_id=1) LIMIT 1
DELETE FROM "accounts" WHERE "id" = 4
DELETE FROM "donors" WHERE "id" = 4
DELETE FROM "donations" WHERE "id" = 1
---
  def destroy
    @donor = Donor.find(params[:id])
    @campaign = Campaign.find(@donor.campaign_id)
    @account = Account.find_by_donor_id(@donor.id)
    @donation = Donation.find(:first, :conditions => ['account_id=? and campaign_id=?', @account.id, @campaign.id])

    @donor.destroy
    @account.destroy