app/controllers/users_controller.rb

INSERT INTO "companies" ("name", "city", "status", "updated_at", "zip_code", "user_id", "address", "state", "created_at") VALUES('acme', 'makati', NULL, '2010-07-10 15:48:07', '12345', NULL, '123 street', 'mm', '2010-07-10 15:48:07')
INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "is_company_admin", "company_id", "remember_token", "first_name", "login", "last_name", "is_agent", "email", "created_at") VALUES('', '482224434246c6ca0abd571fac1b4ab0ee976e4b', '2010-07-10 15:48:07', '88613f309a4ef28a455e308ab02f970b07a86dea', NULL, 't', NULL, NULL, NULL, 'jdoe', NULL, NULL, 'benedict.tabing@gmail.com', '2010-07-10 15:48:07')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    if params[:company]
      @company = Company.new(params[:company])
      @user.company_id = @company.id
      @user.is_company_admin = true
      if !@company.save

SELECT * FROM "users" WHERE (id <> 7 AND company_id != 0 OR (company_id == NULL))
SELECT * FROM "users"
SELECT * FROM "roles"
---
  def user_list
    if current_user.has_role?('admin')
      @users = User.find(:all, :conditions => ['id <> ? AND id <> 1', current_user.id])
    else
      @users = User.all
    end
    @roles = Role.all

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "roles"
SELECT * FROM "roles" WHERE (name != "super")
---
  def edit_user_role
    @user = User.find(params[:id])
    if current_user.has_role?('super')
      @roles = Role.all
    elsif current_user.has_role?('admin')
      @roles = Role.find(:all, :conditions => ['name != "super"'])

SELECT * FROM "users" WHERE ("users"."id" = 3)
SELECT * FROM "roles" WHERE ("roles"."id" = 1)
UPDATE "users" SET "is_agent" = 't', "updated_at" = '2010-07-10 18:32:47' WHERE "id" = 8
---
  def update_user_role
    @user = User.find(params[:user][:id])
    @role = Role.find(params[:user][:role_ids])
    if @role.name == "agent"
      @user.is_agent = true
    end
    @user.update_attributes(params[:user])

UPDATE "users" SET "crypted_password" = '4ef58a304991b739c439dc066ccc3bcdd220c02f', "updated_at" = '2010-07-11 04:04:55' WHERE "id" = 7
---
  def change_password
    return unless request.post?
    if User.authenticate(current_user.login, params[:old_password])
      current_user.password_confirmation = params[:password_confirmation]
      current_user.password = params[:password]
      if current_user.save!